Revit 2020 API
Field.UnitType Property
 The type of units represented by values stored in this field
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2012
Syntax
C#
public UnitType UnitType { get; }
Visual Basic
Public ReadOnly Property UnitType As UnitType
	Get
Visual C++
public:
property UnitType UnitType {
	UnitType get ();
}
See Also
Field Class
Autodesk.Revit.DB.ExtensibleStorage Namespace